function [mag,Wf]=find_harm(res,p3) 
% Нахождение гармоник основной частоты 
% ВХОДНЫЕ ПЕРЕМЕННЫЕ: 
%   res - амплитудный спектр сигнал остатка  по квантованным КЛП 
%   p3  - окончательный ОТ 
% ВЫХОДНЫЕ ПЕРЕМЕННЫЕ:  
%   mag - амплитуды фурье-спектра 
%   Wf  - веса для Евклидова расстояния гармоник Фурье

down=fix(256/p3);   % нижний уровень основной частоты
M=fix(p3/4);        % число гармоник 
% Определение 10 гармоник основной частоты
if M<10  
    for n=1:M 
        up=fix((n+0.5)*512/p3); 
        mag(n)=max(res(down:up)); 
        down=up+1; 
    end
    mag=mag*sqrt(M)/norm(mag);
    mag(M+1:10)=1; 
else
    for n=1:10
        up=fix((n+0.5)*512/p3); 
        mag(n)=max(res(down:up)); 
        down=up+1; 
    end
    mag=mag*sqrt(10)/norm(mag);
end

% Расчет весов для Евклидова расстояния гармоник фурье-спектра
w0 = 2*pi/p3; % расчет основной частоты
for j=1:10
    % взвешивание в соответствие со шкалой барков
	Wf(j) = 117/(25 + 75*power(1 + 1.4*sqrt(w0*j/(0.25*pi)),0.69));
end