function T=intpitch(ss,ipmax,ipmin)
% Определение целочисленного значения ОТ 
% Предусловие: текущий и следующий кадр - ss(1:360) 
% Постусловие: автокорреляция 
% ВХОДНЫЕ ПЕРЕМЕННЫЕ: 
%   ss    - входной сигнал 
%   ipmax - максимальное значение задержки ОТ 
%   ipmin - минимальное значение задержки ОТ 
% ВЫХОДНАЯ ПЕРЕМЕННАЯ: 
%   T     - целочисленное значение задержки ОТ 

r=0;        % максимальное значение нормированной функции автокорреляции
T=80;       % начальное значение задержки ОТ 
r_new=0;    % текущее значение нормированной функции автокорреляции (НФАК)
for tao=ipmin:ipmax     % изменение задержки ОТ
    k=fix(tao/2);
    c0_t=ss(100-k:259-k)*ss(100-k+tao:259-k+tao)';  % числитель НФАК
    c0_0=ss(100-k:259-k)*ss(100-k:259-k)'; 
    ct_t=ss(100-k+tao:259-k+tao)*ss(100-k+tao:259-k+tao)'; 
    den=c0_0*ct_t;                                  % знаменатель НФАК
    if den>0 
        r_new=c0_t*c0_t/den;  % расчет НФАК
    end
    if r_new>r
        r=r_new;    % определение максимального значения НФАК
        T=tao;      % и соответствующей задержки ОТ
    end 
end