function vbp=melp_bpva(melp_bands,melp_envelopes,p2)
% Вариант определения вокализованности полос
% ВХОДНЫЕ ПЕРЕМЕННЫЕ: 
%   melp_bands     - полосовые сигналы 
%   melp_envelopes - огибающие полосовых сигналов 
%   p2             - дробное значение ОТ 
% ВЫХОДНЫЕ ПЕРЕМЕННЫЕ:
%   vbp            - вокализованность полос

p2=round(p2); % округление до целого
for j=1:4     % процедуры для каждой 
    k=j+1;    % из четырех (2-5) полос
    [p(1),r(1)]=fpr(melp_bands(k,:),p2);% определение корреляции между 
                                        % полосовым сигналом и значением ОТ
    [p(2),r(2)]=fpr(melp_envelopes(j,:),p2);% определение корреляции между
                                            % огибающей и значением ОТ
    r(2)=r(2)-0.1;
    % Определение большего коэффиента корреляции
    if r(2)>r(1) 
        temp=r(2); 
    else
        temp=r(1);
    end
    % Принятие решения о вокализованности полосы
    if temp>0.6
        vbp(j)=1; 
    else
        vbp(j)=0;
    end
end
% Если первые три полосы невокализованные, что четвертая тоже
% невокализованная
if vbp(1:3)==[0 0 0] 
    vbp(4)=0; 
end