function G=melp_gain(s,vbp1,p2) 
% Оценивание усиления 
% ВХОДНЫЕ ПЕРЕМЕННЫЕ: 
%   s    - входной сигнал 
%   vbp1 - вокализованность первой полосы 
%   p2   - дробное значение ОТ 
% ВЫХОДНЫЕ ПЕРЕМЕННЫЕ: 
%   G(1) - усиление для первого подкадра
%   G(2) - усиление для второго подкадра

k=1; 
Ltmp=p2; 
Lfr=p2; 
if vbp1>0.6 
    while Ltmp<180 % определение целого числа периодов ОТ
        k=k+1; 
        Lfr=Ltmp;  % длительность сигнала, включающего целое число периодов
        Ltmp=p2*k; 
    end
else
    Lfr=120;       % длительность сигнала, включающего целое число периодов
end 
HL=round(Lfr/2); 
Lfr=HL*2;
% усиление для первого подкадра
G(1)=10*log10(0.01+s(91-HL:90+HL)*s(91-HL:90+HL)'/Lfr); 
% усиление для второго подкадра
G(2)=10*log10(0.01+s(181-HL:180+HL)*s(181-HL:180+HL)'/Lfr); 
for k=1:2 
    if G(k)<0   % если значение усиления меньше 0,
        G(k)=0; % то оно равно 0
    end 
end