function [p3,rp3]=pitch3(sig_in,resid,p2,pavg) 
% Окончательное определение ОТ
% ПРЕДУСЛОВИЯ: sig_in(1:360); resid(1:360) 
% ВХОДНЫЕ ПЕРЕМЕННЫЕ:
%   sig_in - сигнал с выхода префильтра
%   resid  - фильтрованный (ФНЧ 1000 Гц) сигнал остатка предсказания
%   p2     - дробное значение ОТ
%   pavg   - среднее значение ОТ
% ВХОДНЫЕ ПЕРЕМЕННЫЕ:
%   p3     - дробное значение ОТ 
%   rp3    - соответствующая корреляция

p2=round(p2);               % округление дробного значения ОТ
[p3,rp3]=pitch2(resid,p2);  % вычисление дробного значения ОТ по сигналу 
                            % остатка предсказания
if rp3>=0.6 
    Dth=0.5;                % пороговое значение
    if p3<=100 
        Dth=0.75;           % пороговое значение
    end
    [p3,rp3]=double_ck(resid,p3,Dth); %Определение ОТ с удвоенной точностью
else
    [p3,rp3]=fpr(sig_in,p2);          % улучшение дробного значения ОТ  
    if rp3<0.55 
        p3=pavg; 
    else
        Dth=0.7;
        if p3<=100 
            Dth=0.9; 
        end
        [p3,rp3]=double_ck(sig_in,p3,Dth);
                                      %Определение ОТ с удвоенной точностью
    end 
end 
if rp3<0.55     % В случае низкой корреляции значений ОТ, определенных
                % по речевому сигналу и сигналу остатка
    p3=pavg;    % значению ОТ присваивается значение pavg
end