function [p,r]=pitch2(sig,intp) 
% Улучшение дробного значения ОТ в полосе 0-500 Гц
% ВХОДНЫЕ ПЕРЕМЕННЫЕ: 
%   sig  - входной сигнал 
%   intp - целочисленное значение ОТ 
% ВЫХОДНЫЕ ПЕРЕМЕННЫЕ: 
%   p    - дробное значение ОТ 
%   r    - соответствующая корреляция

low=intp-5; % определение нижней границы поиска задержки ОТ (не ниже 20)
if low<20 
    low=20; 
end 
up=intp+5;  % определение верхней границы поиска задержки ОТ (не выше 160)
if up>160 
    up=160; 
end 
p=intpitch(sig,up,low); % определение значения ОТ в указанных пределах
[p,r]=fpr(sig,p);       % улучшение дробного значения ОТ 