function [G1,G2,G2pt,G2p_error]=d_gains(G,G2pt,G2p_error)
% Восстановление усилений
% ВХОДНЫЕ ПАРАМЕТРЫ:
%   G         - принятое значение усиления
%   G2pt      - значение усиления для предыдущего кадра
%   G2p_error - величина, указывающая на различие (>5 Дб) между значениями 
%               усиления для второго подкадра текущего и предыдущего кадров 
% ВЫХОДНЫЕ ПАРАМЕТРЫ:
%   G1        - значение усиления для первого подкадра
%   G2        - значение усиления для второго подкадра
%   G2pt      - значение усиления для предыдущего кадра
%   G2p_error - величина, указывающая на различие (>5 Дб) между значениями 
%               усиления для второго подкадра текущего и предыдущего кадров

delta=67/32;                % шаг квантования
G2=(G(2)+0.5)*delta+10;     % усиление для 2 подкадра восстанавливается
if G(1)==0                  % если индекс квантователя усиления 
                            % для первого подкадра равен 0
    if abs(G2-G2pt)>5       % если разница между значениями усиления для
                            % второго подкадра текущего и предыдущего
                            % кадров более 5 дБ
        if G2p_error==0     % а предыдущей пары кадров такой разницы 
                            % не наблюдалось
            G2=G2pt;        % усилению для второго подкадра присваивается 
                            % значение усиления для предыдущего кадра
        end
        G2p_error=1;
    else                    
        G2p_error=0;
    end
    G1=0.5*(G2+G2pt);       % усиление для первого подкадра определяется 
                            % результатом линейной интерполяции значений
                            % усилений для второго подкадра текущего и
                            % предыдущего кадров
else                        % если индекс квантователя усиления 
                            % для первого подкадра неравен 0
    gain_max=max(G2pt,G2)+6;% осуществляется стандартная процедура 
    gain_min=min(G2pt,G2)-6;% восстановления усиления для 1 подкадра
    if gain_min<10
        gain_min=10;
    end
    if gain_max>77
        gain_max=77; 
    end 
G1=(G(1)-1)*(gain_max-gain_min)/6+gain_min; 
G2p_error=0; 
end 
G2pt=G2;                    % значение усиления для предыдущего кадра