function [hh,prev_scale]=d_ga(h,G,prev_scale,len)
% Регулирование масштаба выходного речевого сигнала
% ВХОДНЫЕ ПЕРЕМЕННЫЕ:
%	h          - речевой сигнал
%	G          - значение усиления
%   prev_scale - предыдущий масштабный коэффициент
%   len        - число отсчетов в сигнале
% ВЫХОДНЫЕ ПЕРЕМЕННЫЕ: 
%	hh         - масштабированный речевой сигнал
%   prev_scale - обновленный предыдущий масштабный коэффициент

scaleover=10;       % число точек для интерполяции масштабного коэффициента
% Преобразование усиления к линейному масштабу                          
gain=power(10,0.05*G);    
% Вычисление масштабного коэффициента% для соответствующего уровня усиления
scale=gain/(sqrt(sum(h(1:len).^2)/len)+0.01);
% Интерполяция масшабных коэффициентов для первых scaleover точек
hh(1:len)=0;
for i=1:(scaleover-1)
    hh(i)=h(i)*((scale*i+prev_scale*(scaleover-i))*(1/scaleover));
end
% Масштабный остаток сигнала
hh(scaleover:len)=h(scaleover:len)*gain;
% Обновление предыдущего масштабного коэффициента
prev_scale=scale;