% определение глобальных переменных
global FMCQ_CODEBOOK; 
global stage1; 
global stage2; 
global melp_firs; 
global Cup Cdown; 

coeff;              % коэффициенты фильтров
stage;              % кодовые книги ЛСЧ
codebook_fmcq1;      
codebook_fmcq2;     % кодовые книги для квантования амплитуд фурье-спектра
d_pdfs;             % коэффициенты импульсного дисперсионного фильтра
Cup=0.0337435; 
Cdown=0.135418; 

t0=1;       % вспомогательная величина, определяющая номер первого отсчета 
            % в восстанавливаемом сигнале на интервале,равном ОТ
p1=0;       % задержка ОТ для предыдущего кадра
ls1=[0 0 0 0 0 0 0 0 0 0]; % вектор ЛСЧ для предыдущего кадра
G2pt=22; 
G2p_error=0; 
Gno=20; 
G2p=20;         % усиление для предыдущего кадра
u1=0;           % значение коэффициента отражения для предыдущего кадра
jt1=0;          % джиттер для предыдущего кадра
fm1(1:10)=1;    % амплитуды преобразования Фурье для предыдущего кадра 
vp1=[];         % вокализованность полос для предыдущего кадра
prev_scale=1;   % предыдущий масштабный коэффициент
% определение начальных условий
v=[];               % начальное состояние речевого сигнала 
state_pul(1:30)=0;  % начальное состояние импульсного формирующего фильтра
state_noi(1:30)=0;  % начальное состояние шумового формирующего фильтра
state_syn(1:10)=0;  % начальное состояние фильтра синтеза
state_disp(1:64)=0; % начальное состояние дисперсионного фильтра
state_tilt=0;       % начальное значение аддитивной составляющей
state_ase(1:10)=0;  % начальное состояние корректирующего фильтра 