% function v=melp_decoder(c) 
clear all
clc
load 'dsp.mat';
global fm2 jt2 vp2 prev_scale; 
G1_1=[];
G2_1=[];
G1_2=[];
G2_2=[];

d_init; %инициализация начальных условий и глобальных переменных
C=c; 
TEMPSIZE=size(C); 
FRN=TEMPSIZE(2); %число кадров
vg=[]; %потом удалить
vsig=[];%потом удалить
vh=[];%потом удалить
for i=1:FRN
    ls2=d_lsf(C(i).ls); %формирование вектора ЛСЧ для текущего кадра
    [G1,G2,G2pt,G2p_error]=d_gains(C(i).G,G2pt,G2p_error); 
    G1_1=[G1_1,G1];
    G2_1=[G2_1,G2];
                            % восстановление усилений
    Gno=noise_est(G1,Gno);  % Обновление адаптивной оценки уровня шума 
                            % на основе прошлого усиления
    G1=noise_sup(G1,Gno);   % усиление для первого подкадра текущего кадра
    Gno=noise_est(G2,Gno);  % Обновление адаптивной оценки уровня шума 
                            % на основе прошлого усиления
    G2=noise_sup(G2,Gno);   % усиление для второго подкадра текущего кадра
    G1_2=[G1_2,G1];
    G2_2=[G2_2,G2];
    
    if C(i).pitch~=0 
        fm2=FMCQ_CODEBOOK(C(i).QFM,:);  % амплитуды фурье-спектра 
                                        % для текущего кадра
        jt2=C(i).jt;            % джиттер для текущего кадра
        vp2=[1,C(i).vp];        % вокализованность полос для текущего кадра
        p2=C(i).pitch;          % задержка ОТ для текущего кадра
    else
        p2=0;                   % задержка ОТ для текущего кадра
    end
    temp=melp_lsf2lpc(ls2);  % LSF в LPC 
    u2=max(0,d_k1(temp)*0.5);% расчет первого коээфициента отражения 
                             % для текущего кадра
    if (p1==0)&&(p2~=0)      
        fm1=fm2;             % амплитуды преобразования Фурье 
                             % для предыдущего кадра
        p1=p2;               % задержка ОТ для предыдущего кадра
        jt1=jt2;             % джиттер для предыдущего кадра
        vp1=vp2;             % вокализованность полос для предыдущего кадра
    end
    if t0>1  % вспомогательная величина, определяющая номер первого отсчета 
             % в восстанавливаемом сигнале на интервале,равном ОТ
       sig_fr=sig_fr(181:t0+179);  % сигнал на входе дисперсионного фильтра
    else
    sig_fr=[];                     % начальные условия t0=1
    end
    while t0<181    % процесс для каждого периода ОТ
        e=0;     % смешанный сигнал возбуждения
        g=0;     % сигнал на выходе блока адаптивной спектральной коррекции
        h=0;     % сигнал на выходе синтезирующего фильтра
        % Восстановление сигнала на периоде ОТ
        % интерполяция параметров
        if p2==0            % если текущий кадр невокализованный (unvoiced)
                            % (задержка ОТ равна 0) 
            T=50;           % задержке ОТ присваивается значение 50
            factor=t0/180;  % коэффициент, учитывающий число периодов ОТ 
                            % в восстанавливаемом кадре
            if t0<91        % если обрабатывается первый подкадр
                G=G2p+2*factor*(G1-G2p);    % интерполяция усиления 
                                            % для первого подкадра (0~90) 
            else
                G=G1+(2*factor-1)*(G2-G1);  % интерполяция усиления 
                                            % для второго подкадра (91~180)
            end
            if i==1                         % для первого кадра
                lsfs=ls2;                   % используются принятые ЛСЧ
            else                            % для последующих
                lsfs=factor*(ls2-ls1)+ls1;  % ЛСЧ интерполируются
            end
            u=factor*(u2-u1)+u1;            % интерполяция коэффициента 
                                            % отражения №1
        else                                % если текущий кадр 
                                            % вокализованный (voiced) 
            factor=t0/180;    % коэффициент, учитывающий число периодов ОТ 
                              % в восстанавливаемом кадре
            jt=factor*(jt2-jt1)+jt1;  % интерполяция джиттера
            fm=factor*(fm2-fm1)+fm1;  % интерполяция амплитуд фурье-спектра
            vp=factor*(vp2-vp1)+vp1;  % интерполяция вокализованности полос
            if t0<91 
                G=G2p+factor*(G1-G2p)/90;   % интерполяция усиления 
                                            % для первого подкадра 
            else
                G=G1+factor*(G2-G1)/90;     % интерполяция усиления 
                                            % для второго подкадра 
            end
            if G2-G2p>6     % если разница в величине усиления для второго
                            % подкадра текущего и предыдущего кадра более 6
                factor=(G-G2p)/(G2-G2p);    % перерасчет коэффициента
            end
            if i==1                         % для первого кадра
                lsfs=ls2;                   % используются принятые ЛСЧ
            else                            % для последующих
                lsfs=factor*(ls2-ls1)+ls1;  % ЛСЧ интерполируются
            end
            T=factor*(p2-p1)+p1;        % интерполяция значения задержки ОТ
            u=factor*(u2-u1)+u1;        % интерполяция коэффициента 
                                        % отражения №1
            if ((G1-G2p)>6)&&(p1>2*p2)  % если значение усиления для 1-го
                                        % подкадра текущего кадра на 6 
                                        % больше усиления для предыдущего
                                        % кадра и значение задержки ОТ
                                        % более чем в 2 раза значение
                T=p2;                   % задержки не интерполируется
            end
        end
        if p2==0                % если значение задержки ОТ равно 0
            e=rand(1,T)-1;      % сигнал возбуждения формируется 
                                % генератором случайных чисел 
        else
           [e,state_pul,state_noi,T]=d_mix(fm,T,jt,vp,state_pul,state_noi);
                                % формируется смешанный сигнал возбуждения 
        end
        lpcs=melp_lsf2lpc(lsfs);        % LSF в LPC
        [g,state_ase,state_tilt]=d_ase(e,lpcs,G,Gno,u,T,...
            state_ase,state_tilt);      % адаптивная спектральная коррекция
        vg=[vg,g];
        [h,state_syn]=d_lps(lpcs,g,T,state_syn); % синтез РС
        vh=[vh,h];
        [h,prev_scale]=d_ga(h,G,prev_scale,T);
                                        % усиление синтезированого сигнала
        prev_sc(i,t0)=prev_scale;
        sig_fr=[sig_fr,h];
        t0=t0+T;     % переход к следующему периоду ОТ на интервале синтеза
    end 
    vsig=[vsig,sig_fr];
    [temp,state_disp]=d_disp(sig_fr,state_disp,disperse); 
                    % импульсный дисперсионный фильтр
    v=[v,temp];     % синтезированный речевой сигнал
    G2p=G2;         % усиление для второго подкадра предыдущего кадра
    ls1=ls2;        % формирование вектора ЛСЧ для предыдущего кадра
    u1=u2;          % коэффициент отражения для предыдущего кадра
    t0=t0-180; 
    if p2~=0 
        p1=p2;      % задержка ОТ для предыдущего кадра
        fm1=fm2;    % амплитуды преобразования Фурье для предыдущего кадра
        jt1=jt2;    % джиттер для предыдущего кадра
    end 
end
S=v/32767^2;          % синтезированный речевой сигнал